In [1]:
import pandas as pd

In [36]:
import numpy as np

In [7]:
apples = pd.Series ([3,2, 0, 1,])
oranges = pd.Series ([3, 4, 7, 8,])

data = {"apples":apples, "oranges":oranges} #make dictionary of pandas data
fruits_df = pd.DataFrame(data) #insert dictionary in data frame of pandas
print(fruits_df)

   apples  oranges
0       3        3
1       2        4
2       0        7
3       1        8

In [8]:
apples = pd.Series ([3,2, 0, 1,], index = ["a", "b", "c", "d"])
oranges = pd.Series ([3, 4, 7, 8,], index = ["mon", "tue", "wed", "thu"])

data = {"apples":apples, "oranges":oranges} #make dictionary of pandas data
fruits_df = pd.DataFrame(data) #insert dictionary in data frame of pandas
print(fruits_df)

     apples  oranges
a       3.0      NaN
b       2.0      NaN
c       0.0      NaN
d       1.0      NaN
mon     NaN      3.0
thu     NaN      8.0
tue     NaN      4.0
wed     NaN      7.0

In [9]:
apples = pd.Series ([3,2, 0, 1,], index = ["mon", "tue", "wed", "thu"])
oranges = pd.Series ([3, 4, 7, 8,], index = ["mon", "tue", "wed", "thu"])

data = {"apples":apples, "oranges":oranges} #make dictionary of pandas data
fruits_df = pd.DataFrame(data) #insert dictionary in data frame of pandas
print(fruits_df)

     apples  oranges
mon       3        3
tue       2        4
wed       0        7
thu       1        8

In [24]:
state = ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"]
data = {"State":state, "year":[2000, 2001, 2002, 2000, 2001, 2002], "pop":[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
state_pop_df = pd.DataFrame(data, index=["1st", "2nd", "3rd", "4th", "5th", "6th"])
print (state_pop_df)

      State  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2000  2.4
5th  Nevada  2001  2.9
6th  Nevada  2002  3.2

In [25]:
state_pop_df["State"] #search particular column

1st      Ohio
2nd      Ohio
3rd      Ohio
4th    Nevada
5th    Nevada
6th    Nevada
Name: State, dtype: object

In [28]:
state_pop_df = pd.DataFrame(data, 
                            index=["1st", "2nd", "3rd", "4th", "5th", "6th"], 
                            columns=["year", "State", "pop", "debt"])
state_pop_df.head(6) #print first 5 in default or as comanded

     year   State  pop debt
1st  2000    Ohio  1.5  NaN
2nd  2001    Ohio  1.7  NaN
3rd  2002    Ohio  3.6  NaN
4th  2000  Nevada  2.4  NaN
5th  2001  Nevada  2.9  NaN
6th  2002  Nevada  3.2  NaN

In [31]:
print(state_pop_df.tail(3)) #print last 5 as default or as comanded

     year   State  pop debt
4th  2000  Nevada  2.4  NaN
5th  2001  Nevada  2.9  NaN
6th  2002  Nevada  3.2  NaN

In [30]:
print(state_pop_df.columns)
print(state_pop_df.index)

Index(['year', 'State', 'pop', 'debt'], dtype='object')
Index(['1st', '2nd', '3rd', '4th', '5th', '6th'], dtype='object')

In [32]:
state_pop_df.State

1st      Ohio
2nd      Ohio
3rd      Ohio
4th    Nevada
5th    Nevada
6th    Nevada
Name: State, dtype: object

In [34]:
print(state_pop_df.loc["3rd"])

year     2002
State    Ohio
pop       3.6
debt      NaN
Name: 3rd, dtype: object

In [35]:
state_pop_df["debt"] = 1.4
state_pop_df

     year   State  pop  debt
1st  2000    Ohio  1.5   1.4
2nd  2001    Ohio  1.7   1.4
3rd  2002    Ohio  3.6   1.4
4th  2000  Nevada  2.4   1.4
5th  2001  Nevada  2.9   1.4
6th  2002  Nevada  3.2   1.4

In [38]:
ln = len(state_pop_df)
rng = np.arange(ln)
state_pop_df["debt"] = rng
state_pop_df

     year   State  pop  debt
1st  2000    Ohio  1.5     0
2nd  2001    Ohio  1.7     1
3rd  2002    Ohio  3.6     2
4th  2000  Nevada  2.4     3
5th  2001  Nevada  2.9     4
6th  2002  Nevada  3.2     5

In [40]:
deb = [2, 4, 2, 4, 4, 1]
state_pop_df["debt"] = deb
state_pop_df

     year   State  pop  debt
1st  2000    Ohio  1.5     2
2nd  2001    Ohio  1.7     4
3rd  2002    Ohio  3.6     2
4th  2000  Nevada  2.4     4
5th  2001  Nevada  2.9     4
6th  2002  Nevada  3.2     1

In [41]:
val = pd.Series([1, 2, 3, 4, 5, 3, 1], index=["1st", "2nd", "3rd", "4th", "5th", "6th", "7th"])
state_pop_df["debt"] = val
state_pop_df

     year   State  pop  debt
1st  2000    Ohio  1.5     1
2nd  2001    Ohio  1.7     2
3rd  2002    Ohio  3.6     3
4th  2000  Nevada  2.4     4
5th  2001  Nevada  2.9     5
6th  2002  Nevada  3.2     3

In [49]:
obj3 = pd.Series(["blue", "yellow", "purple"], index = [2, 5, 9])
print (obj3)
obj4 = obj3.reindex(range(9))
print (obj4)
obj5 = obj3.reindex(range(9), method = "bfill")
print (obj5)

2      blue
5    yellow
9    purple
dtype: object
0       NaN
1       NaN
2      blue
3       NaN
4       NaN
5    yellow
6       NaN
7       NaN
8       NaN
dtype: object
0      blue
1      blue
2      blue
3    yellow
4    yellow
5    yellow
6    purple
7    purple
8    purple
dtype: object

In [55]:
states = pd.DataFrame(np.arange(9).reshape((3,3)),
                      index = ["a", "c", "d"], 
                      columns = ["Ohio", "Texas", "California"])
print (states)

states2 = states.reindex(["a", "b", "c", "d"])
print(states2)

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8
   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [56]:
states_name =["Texas", "Ohio", "Utha", "California"]
states3 = states.reindex(columns = states_name)
states3

   Texas  Ohio  Utha  California
a      1     0   NaN           2
c      4     3   NaN           5
d      7     6   NaN           8

In [59]:
data_df = pd.DataFrame(np.arange(16).reshape((4, 4)),
                       index = ["Texas", "Ohio", "Utha", "California"],
                       columns = ["a", "b", "c", "d"])
print(data_df)
#data_df = data_df.drop("b", axis=1)
#data_df.drop("b", axis=1)
print(data_df)

             a   b   c   d
Texas        0   1   2   3
Ohio         4   5   6   7
Utha         8   9  10  11
California  12  13  14  15
             a   b   c   d
Texas        0   1   2   3
Ohio         4   5   6   7
Utha         8   9  10  11
California  12  13  14  15

In [62]:
print(data_df.one[2:])

AttributeError: 'DataFrame' object has no attribute 'one'

In [63]:
print(data_df.iloc[2, [3, 0, 1]])

d    11
a     8
b     9
Name: Utha, dtype: int32

In [64]:
print(data_df.iloc[:])

             a   b   c   d
Texas        0   1   2   3
Ohio         4   5   6   7
Utha         8   9  10  11
California  12  13  14  15

In [65]:
print(data_df.iloc[:3, :3])

       a  b   c
Texas  0  1   2
Ohio   4  5   6
Utha   8  9  10

In [66]:
print(data_df.iloc[:, :3])

             a   b   c
Texas        0   1   2
Ohio         4   5   6
Utha         8   9  10
California  12  13  14

In [68]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)),
                   columns = list ("bcd"),
                   index=["Ohio", "Texas", "Colorado"])

df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                   columns=list("bde"),
                   index=["Utha", "Ohio", "Texas", "Oregon"])

print(df1)
print(df2)
df3 = df1+df2
print(df3)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0
          b     d     e
Utha    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0
            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utha      NaN NaN   NaN NaN

In [70]:
df4 = df1.add(df2, fill_value=0)
print(df4)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utha      0.0  NaN   1.0   2.0